In [1]:
import pandas as pd
data_frame=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
# some operations
print(data_frame.head(3))
print(data_frame.shape)

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
(891, 12)

In [2]:
from IPython.display import display
# access the rows and columns of the data frames 
""" use of loc and iloc"""
# iloc is used for integer indexing and loc is used for name
# if you want to access the frst n rows
display(data_frame.iloc[0:2]) # [ start: end-1]
""" and loc is used for names. loc is also known as location. in this the index value is considered as name """
display(data_frame.loc[0:3])
# in the output the indexing value 0,1,2,3 is considered as names

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [3]:
""" alternate syntax to print the values"""
""" 
from IPython.display import display
display( ..............)
"""

' \nfrom IPython.display import display\ndisplay( ..............)\n'

In [4]:
# use of loc : if you want to print the first n rows but with specific columns
from IPython.display import display
display(data_frame.loc[0:30,["Name","Sex","Fare"]])

                                                 Name     Sex      Fare
0                             Braund, Mr. Owen Harris    male    7.2500
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female   71.2833
2                              Heikkinen, Miss. Laina  female    7.9250
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female   53.1000
4                            Allen, Mr. William Henry    male    8.0500
5                                    Moran, Mr. James    male    8.4583
6                             McCarthy, Mr. Timothy J    male   51.8625
7                      Palsson, Master. Gosta Leonard    male   21.0750
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female   11.1333
9                 Nasser, Mrs. Nicholas (Adele Achem)  female   30.0708
10                    Sandstrom, Miss. Marguerite Rut  female   16.7000
11                           Bonnell, Miss. Elizabeth  female   26.5500
12                     Saundercock, Mr. William Henry    male    8.0500
13                        Andersson, Mr. Anders Johan    male   31.2750
14               Vestrom, Miss. Hulda Amanda Adolfina  female    7.8542
15                   Hewlett, Mrs. (Mary D Kingcome)   female   16.0000
16                               Rice, Master. Eugene    male   29.1250
17                       Williams, Mr. Charles Eugene    male   13.0000
18  Vander Planke, Mrs. Julius (Emelia Maria Vande...  female   18.0000
19                            Masselmani, Mrs. Fatima  female    7.2250
20                               Fynney, Mr. Joseph J    male   26.0000
21                              Beesley, Mr. Lawrence    male   13.0000
22                        McGowan, Miss. Anna "Annie"  female    8.0292
23                       Sloper, Mr. William Thompson    male   35.5000
24                      Palsson, Miss. Torborg Danira  female   21.0750
25  Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...  female   31.3875
26                            Emir, Mr. Farred Chehab    male    7.2250
27                     Fortune, Mr. Charles Alexander    male  263.0000
28                      O'Dwyer, Miss. Ellen "Nellie"  female    7.8792
29                                Todoroff, Mr. Lalio    male    7.8958
30                           Uruchurtu, Don. Manuel E    male   27.7208